# Pandas

In [5]:
import pandas as pd
import numpy as np
#Multi-index is in Dataframe-3 
#pivot tables is in Operations

In [30]:
pd.Series(data=datavar,index=indvar)  #creates a series, series is array with index, index can be modified
series1 + series2                     #series can be added, only the matching index gives result, rest will be null
                                      #after addition values will be stored as float
pd.DataFrame(data, column)
dfvar.drop('column/rowname',axis,     #axis 1 is column & 0 is row(default), inplace true makes permanent change
           inplace=True)     
dfvar.loc('row')                      #to select rows. for columns use normal brackets, for subset selection use this
dfvar.iloc(index)                     #to select rows based on numeric index value
dfvar.loc['row','column']             #for subset selection use this, notice its square bracket not regular and loc is used
dfvar.loc[['row1','row2],
          ['column1','column2']]
dfvar[dfvar>0]                        #conditional selection, true values will be displayed and false will be as null
Use &,|                               #and and or cant do conditioning for multiple values
dfvar.reset_index(inplace=True)       #resets index to integer and original index turns into a column
dfvar.set_index('columnname')         #makes the column as index, original index will be overwritten
dfvar.index.names                     #shows names of index, to assign value to index use'=' and pass values in []
np.na                                 #enters null value
dfvar.dropna(axis,thresh=1)           #drops rows/column if null value is present, axis default 0 aka row, thresh is condition
                                      #for to keep rows/column based on non null values, thresh = non null values
dfvar.fillna(value='')                #replaces null values, good practice to enter mean of that column
dfvar.groupby('columnname')           # groups similar value, later use .mean(),count(),max(),min(),sum(),describe(),descibe().transpose()
                                      #function to perform some action, 
dfvar.concat([df1,df2,df3],axis=1)    # joins different data frame either on rows or columns based on axis value passed
dfvar['columnname'].unique()          #shows unique value, add len before dfvar to get count
dfvar['columnname'].nunique()         #gives count instead of unique values
dfvar['columnname'].value_counts()    #shows count of each & every element in column
dfvar['columnname'].apply(function)   #enables you to apply own or existing functions
dfvar.columns                         #gives all column names
dfvar.index                           #lists all index names
dfvar.sort_values('columnname')       #sorts and re-arranges value in ascending
dfvar.isnull()                        #shows null value in boolean values
pwd                                   #shows filepath or directory
pd.read_csv('filename')               #file name only when notebook and csv is in same location or else have to use full path,
                                      #click+tab to auto-complete
dfvar.to_csv('filename',index=False)  #writes dataframe to a new file, index false avoids converting index into column
dfvar.read_excel('filename.xlsx'      #to read excel file
              ,sheetname='Sheet1')
dfvar.to_excel('filename.xlsx'        #sheet_name, to write on new excel file
            ,sheet_name='Sheet1'
html = pd.read_html('website link')   #to read website data
html[0].head()                        #to read content of data grabbed from website

### SERIES

In [ ]:
1. series can hold almost all data types
2.

In [3]:
pd.Series(data=[1,2,3,4],index=['first','second','third','fourth'])

first     1
second    2
third     3
fourth    4
dtype: int64

# DataFrame

In [ ]:
1. DataFrame is combination of multiple series

In [10]:
a = np.arange(1,26).reshape(5,5)
a

array([[ 1,  2,  3,  4,  5],
       [ 6,  7,  8,  9, 10],
       [11, 12, 13, 14, 15],
       [16, 17, 18, 19, 20],
       [21, 22, 23, 24, 25]])

In [45]:
df = pd.DataFrame( a, ['A','B','C','D','E'],['F','G','H','I','J'])
df

    F   G   H   I   J
A   1   2   3   4   5
B   6   7   8   9  10
C  11  12  13  14  15
D  16  17  18  19  20
E  21  22  23  24  25

In [46]:
df['F'] 
#series

A     1
B     6
C    11
D    16
E    21
Name: F, dtype: int32

In [47]:
df[['F','H']]
#to get multiple columns

    F   H
A   1   3
B   6   8
C  11  13
D  16  18
E  21  23

In [48]:
df['new'] = df['F'] + df['H']

In [49]:
df

    F   G   H   I   J  new
A   1   2   3   4   5    4
B   6   7   8   9  10   14
C  11  12  13  14  15   24
D  16  17  18  19  20   34
E  21  22  23  24  25   44

In [50]:
df.drop('new', axis=1,inplace = True)

In [51]:
df

    F   G   H   I   J
A   1   2   3   4   5
B   6   7   8   9  10
C  11  12  13  14  15
D  16  17  18  19  20
E  21  22  23  24  25

.

In [52]:
df[df>14]
#whole dataframe is passed in conditon

      F     G     H     I     J
A   NaN   NaN   NaN   NaN   NaN
B   NaN   NaN   NaN   NaN   NaN
C   NaN   NaN   NaN   NaN  15.0
D  16.0  17.0  18.0  19.0  20.0
E  21.0  22.0  23.0  24.0  25.0

In [53]:
df[df['F'] >12]
#a particular column is passed in condition and where it is false the particular row gets eliminated

    F   G   H   I   J
D  16  17  18  19  20
E  21  22  23  24  25

In [56]:
df

    F   G   H   I   J
A   1   2   3   4   5
B   6   7   8   9  10
C  11  12  13  14  15
D  16  17  18  19  20
E  21  22  23  24  25

In [60]:
df.index.names = ['O']

In [61]:
df

    F   G   H   I   J
O
A   1   2   3   4   5
B   6   7   8   9  10
C  11  12  13  14  15
D  16  17  18  19  20
E  21  22  23  24  25

In [66]:
pwd

'D:\\Udemy Jose\\Final_notes\\Pandas'